Tekla.Structures.Model.Model
The Model class represents a single model open in Tekla Structures.
Before interaction with the model, the user will have to create one
instance of this class.

Tekla.Structures.Model.Model.#ctor
Creates a "handle" to the currently open model.

Tekla.Structures.Model.Model.GetConnectionStatus
Returns true if a proper connection to the Tekla Structures process has been established.
Currently, there's no way to re-establish the connection.
Returns: True on success.

Tekla.Structures.Model.Model.GetInfo
Returns information about the currently open model.
Returns: A ModelInfo instance on success.

Tekla.Structures.Model.Model.GetProjectInfo
Returns information about the current model's project.
Returns: A ProjectInfo instance on success.

Tekla.Structures.Model.Model.GetPhases
Returns information about the current model's phases.
Returns: A PhaseCollection instance on success.

Tekla.Structures.Model.Model.GetModelObjectSelector
Returns a ModelObjectSelector instance from which different kind of selections
can be made.
Returns: A new ModelObjectSelector instance.

Tekla.Structures.Model.Model.SelectModelObject(Tekla.Structures.Identifier,Tekla.Structures.Model.ModelObject.ModelObjectEnum)
Takes as Input an ID to a object and then instantiates and selects it before returning it.
ID: The identifier of the ModelObject that we wish to select
Type: Type of the object
Returns:

Tekla.Structures.Model.Model.SelectModelObject(Tekla.Structures.Identifier)
Takes as input an identifier to an object and then checks its type and
instantiates and selects it before returning it.
ID: The identifier of the model object that is to be selected.
Returns: The selected model object with the given identifier,
or null if object does not exists or object data loading failed for some reason.

Tekla.Structures.Model.Model.FetchModelObjects(System.Collections.Generic.List{System.String},System.Boolean)
Fetches a list of modelobjects based on given guid list of objects,
checks if guid is native or external (for reference model object)
and optionally selects objects before returning them.
Guids: The GUID list to look for in the model.
SelectInstances: Optional parameter whether object is selected, default = true.
Returns: The model objects with the given guids,
or empty list if any of the objects do not exists or object data loading failed for some reason.
Guids of selected model objects are stored to list and fetched using guid list:
using System;
using System.Collections.Generic;
using System.Windows.Forms;
using Tekla.Structures.Model;
using TSMU = Tekla.Structures.Model.UI;
public class Example
{
public void Example1()
{
Model model = new Model();
var selector = new TSMU.ModelObjectSelector();
var selection = selector.GetSelectedObjects();
var guidList = new List<string>();
foreach (ModelObject obj in selection)
{
var ro = obj as ReferenceModelObject;
string guid = string.Empty;
if (ro != null)
{
if(ro.GetReportProperty("EXTERNAL.GUID", ref guid))
guidList.Add(guid);
}
else
{
guidList.Add(obj.Identifier.GUID.ToString());
}
}
var objList = model.FetchModelObjects(guidList, false);
MessageBox.Show(objList.Count.ToString() + " objects found.");
}
}

Tekla.Structures.Model.Model.FetchModelObjects(System.Collections.Generic.List{Tekla.Structures.Identifier},System.Boolean)
Fetches a list of modelobjects based on given identifier list of objects,
and optionally selects objects before returning them.
Ids: The identifier list to look for in the model.
SelectInstances: Optional parameter whether object is selected, default = true.
Returns: The model objects with the given identifiers
skipping the objects which do not exists or object data loading failed for some reason.
Identifiers of selected model objects are stored to list and fetched using list:
using System;
using System.Collections.Generic;
using System.Windows.Forms;
using Tekla.Structures.Drawings;
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
// open document manager instance
DrawingHandler DrawingHandler = new DrawingHandler();
var drawingEnumerator = DrawingHandler.GetDrawings();
while (drawingEnumerator.MoveNext())
{
Drawing drawing = dEnumerator.Current as Drawing;
if (drawing != null)
{
// get model objects identifiers from the drawing
var idList = DrawingHandler.GetModelObjectIdentifiers(drawing);
// fetch model objects in the drawing
Model model = new Model();
var objList = model.FetchModelObjects(idList, false);
MessageBox.Show(objList.Count.ToString() + " objects found.");
}
}
}
}

Tekla.Structures.Model.Model.GetIdentifierByGUID(System.String)
Returns an identifier instance that has the given GUID in the model.
guid: The GUID to look for in the model.
Returns: The identifier of the GUID, or null if not found.

Tekla.Structures.Model.Model.GetGUIDByIdentifier(Tekla.Structures.Identifier)
Returns the GUID of the given identifier instance.
identifier: The identifier to look for in the model.
Returns: The GUID of the identifier.

Tekla.Structures.Model.Model.CommitChanges
Commits the changes made to the model database so far. One commit is something that a
user can later on undo with the undo command. A commit also launches the drawing of the
changed product model to the visible views. A dependent plug-in should never call CommitChanges,
since this would make undo very difficult for the user to do. However, non-dependent plug-ins
require a separate commit if new objects are created.
Returns: True on success.
Deprecated since TS v2018.

Tekla.Structures.Model.Model.CommitChanges(System.String)
Commits the changes made to the model database so far. One commit is something that a
user can later on undo with the undo command. A commit also launches the drawing of the
changed product model to the visible views. A plug-in should never call CommitChanges,
since this would make undo very difficult for the user to do.
Message: The message to be saved with the commit.
Returns: True on success.

Tekla.Structures.Model.Model.GetWorkPlaneHandler
Returns a new work plane handler for the model. The work plane handler
can be used to manipulate the current work plane in the model.
Returns: The new work plane handler instance.

Tekla.Structures.Model.Model.GetClashCheckHandler
Returns a new clash check handler.
Returns: The new clash check handler instance.

Tekla.Structures.Model.Model.GetReportPropertyStr(System.Collections.Generic.IList{Tekla.Structures.Identifier},System.String)
Get a list of property values, where the property is of type string, for the given identifiers.
identifiers: The list of identifiers to get the property for.
property: The name of the property to get.
Returns: The string values of the property for the given identifiers.

Tekla.Structures.Model.Model.GetReportPropertyInt(System.Collections.Generic.IList{Tekla.Structures.Identifier},System.String)
Get a list of property values, where the property is of type interger, for the given identifiers.
identifiers: The list of identifiers to get the property for.
property: The name of the property to get.
Returns: The integer values of the property for the given identifiers.

Tekla.Structures.Model.Model.GetReportPropertyDouble(System.Collections.Generic.IList{Tekla.Structures.Identifier},System.String)
Get a list of property values, where the property is of type double, for the given identifiers.
identifiers: The list of identifiers to get the property for.
property: The name of the property to get.
Returns: The double values of the property for the given identifiers.